Tekla Open API Reference for Tekla Structures 2025
Integer Implicit Conversion (Int32 to Integer)
 Converts from int to Datatype.Integer.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static implicit operator Integer (
	int From
)
Public Shared Widening Operator CType (
	From As Integer
) As Integer
Parameters
From
Type: System.Int32
The value to be converted.
Return Value
Type: Integer
The converted Datatype.Integer value.
See Also
Reference
Integer Structure
Implicit Overload
Tekla.Structures.Datatype Namespace